<template class="j">
  <div id="h">
      
      <personal />

      <div class="back">
        <img src='@/assets/j-back.jpg'>
      </div> 
       <div class="banner">
        <p>心理问题等级划分从健康状态到心理疾病状态一般可分为4个等级：无抑郁心理→轻度抑郁心理→中度抑郁心理→重度抑郁心理。</p>
       </div> 
        <div class="banner-1">
         <h1>您的心理状态</h1>
        </div>
        <div class="banner-2">          
        <div v-if="sum>=0.7">
          <p>重度抑郁心理：</p><br/>
       <p>心理疾病是由于个人及外界因素引起个体强烈的心理反应（思维、情感、动作行为、意志）并伴有明显的躯体不适感。是大脑功能失调的外在表现。其特点是：</p><br/>
  <p>1、强烈的心理反应-可出现思维判断上的失误，思维敏捷性的下降，记忆力下降，头脑粘滞感、空白感，强烈自卑感及痛苦感，缺乏精力、情绪低落成忧郁，紧张焦虑，行为失常（如重复动作，动作减少，退缩行为等），意志减退等等。</p><br/>
  <p>2、明显的躯体不适感-由于中枢控制系统功能失调可引起所控制人体各个系统功能失调：如影响消化系统则可出现食欲不振、腹部胀满、便秘或腹泻（或便秘-腹泻交替）等症状；影响心血管系统则可出现心慌、胸闷、头晕等症状；影响到内分泌系统可出现女性月经周期改变、男性性功能障碍……等等。</p><br/>
  <p>3、损害大-此状态之患者不能或勉强完成其社会功能，缺乏轻松、愉快的体验，痛苦感极为强烈，“哪里都不舒服”、“活着不如死了好”是他们真实的内心体验。</p><br/>
  <p>4、需心理医生的治疗-此状态之患者一般不能通过自身调整和非心理科专业医生的治疗而康复。心理医生对此类患者的治疗一般采用心理治疗和药物治疗相结合的综合治疗手段。在治疗早期通过情绪调节药物快速调整情绪，中后期结合心理治疗解除心理障碍并通过心理训练达到社会功能的恢复并提高其心理健康水平。</p>
        </div>
       <div v-else-if="sum>=0.6&&sum<=0.69">
        <p>中度抑郁心理：</p><br/>
        <p>心理障碍是因为个人及外界因素造成心理状态的某—方面（或几方面）发展的超前、停滞、延迟、退缩或偏离。它的特点是：</p><br/>
  <p>1、不协调性-其心理活动的外在表现与其生理年龄不相称或反应方式与常人不同。如：成人表现出幼稚状态（停滞、延迟、退缩）；儿童出现成人行为（不均衡的超前发展）；对外界刺激的反应方式异常（偏离）等等。</p><br/>
  <p>2、针对性-处于此类状态的人往往对障碍对象（如敏感的事、物及环境等）有强烈的心理反应（包括思维、信维及动作行为），而对非障碍对象可能表现很正常。</p><br/>
  <p>3、损害较大-此状态对其社会功能影响较大。它可能使当事人不能按常人的标准完成其某项（或某几项）社会功。如：社交焦虑考（又名社交恐惧）不能完成社交活动，锐器恐怖者不敢使用刀、剪，性心理障碍者难以与异性正常交往。</p><br/>
  <p>4、需求助于心理医生-此状态者大部分不能通过自我调整和非专业人员的帮助而解决根本问题。心理医生的指导是必须的。</p>
      </div>
       <div v-else-if="sum>=0.5&&sum<=0.59">  
        <p>轻度抑郁心理：</p><br/>
      <p>又称第三状态，是界于健康状态与疾病状态之间的状态。是正常人群组中常见的一种亚健康状态，它是由于个人心理素质（如过于好胜、孤僻、敏感等）、生活事件（如工作压力大、晋升失败、被上司批评、婚恋挫折等）、身体不良状况（如长时间加班劳累、身体疾病）等因素所引起。它的特点是：</p><br/>
  <p>1、时间短暂-此状态持续时间较短，一般在一周以内能得到缓解。</p><br/>
  <p>2、损害轻微-此状态对其社会功能影响比较小。处于此类状态的人一般都能完成日常工作学习和生活，只是感觉到的愉快感小于痛苦感，“很累”、“没劲”、“不高兴”、“应付”是他们常说的词汇。</p><br/>
  <p>3、能自已调整-此状态者大部分通过自我调整如休息、聊天、运动、钓鱼、旅游、娱乐等放松方式能使自己的心理状态得到改善。小部分人若长时间得不到缓解可能形成一种相对固定的状态。这小部分人应该去寻求心理医生的帮助，以尽快得到调整。</p>
      </div>
      <div v-else-if="sum<0.5"> 
      <p> 无抑郁心理：</p><br/>
      <p>心理健康状态与非健康状态的区分标准一直是心理学界讨论的话题，不少国内外心理学学者根据自己研究调查的结果提出了多种心理健康标准。在临床心理学实践工作中，总结了前人的理论与经验，提出了一简捷的评价方法。即：从本人评价，他人评价和社会功能状况三方面分析：</p><br/>
  <p>1、本人不觉得痛苦-即在一个时间段中（如一周、一月、一季或一年）快乐的感觉大于痛苦的感觉。</p><br/>
  <p>2、他人不感觉到异常-即心理活动与周围环境相协调，不出现与周围环境格格不久的现象。</p><br/>
  <p>3、社会功能良好-即能胜任家庭和社会角色，能在一般社会环境下充分发挥自身能力利用现有条件（或创造条件）实现自我价值。</p>
      </div>
    </div> 
  <div>  
     <router-link to="/index" type="primary" class="bnt">
        <el-button type="text" >返回主页面</el-button>
    </router-link>
  </div>
  </div>
  </template>

<script>
import personal from '@/components/personal.vue'
export default {
  components: { personal },
  name: "judge",
  data() {
    return {
      sum: 0
    }
  },
  mounted() {
    this.sum = this.$route.params.sum
  }
}
</script>

<style scoped>
  *{
    margin:0;
    padding: 0;
  }
  .header{
    width: 100%;
    height: 50px;
    background: #ffffff;
    box-shadow: 0 2px 4px rgba(0, 0, 0, .12), 0 0 6px rgba(0, 0, 0, .04)
  }
  .header-l{
    position: absolute;
    padding: 5px;
  }
  .header-r{
    position: relative;
    float:right;
    padding: 5px;
  }
  img{
    width:1920px;
    height:1200px;
    opacity: 0.5;
    position: fixed;
  }
  .banner{
    /* position:absolute;
    bottom: 500px;
    left: 180px; */
    margin-left: 200px;
    margin-top: 30px;
  }
  .banner-1{
    /* position: absolute;
    bottom: 430px;
    left:520px;  */
    margin-top: 25px;
    margin-left: 530px;
  }
  .banner-2{
    /* position: absolute;
    bottom: 100px;
    left:80px;  */
     margin-top:30px;
     margin-right: 100px;
     margin-left: 100px;
  }
  .bnt{
    position: absolute;
    bottom: 20px;
    left:1200px; 
  }
</style>
